/* Напишите программу для решения следующей задачи.
На контрольной работе по алгебре ученткам 9 класса было прредложено 
10 примеров. Неудовлетворительная оценка выставляется, если правильно
решено менее половины примеров. Сколько неудовлетворительных оценок 
было получено учениками? Если хотя бы один из учеников правильно решил 
все задачи, выведите YES, иначе - выведите NO.
Программа получает на входе количество учеников в классе N (1 <= N <=30),
затем для каждого ученика вводится количество правильно решенных
примеров. */

int n=Convert.ToInt32(Console.ReadLine());
int k=0; //Счетчик
bool flag=false; //Флаг
// Вводим цикл
for(int i=0;i<n;i++) // Пока i меньше n? увеличиваем i на единицу
{
    int a=Convert.ToInt32(Console.ReadLine());
    if (a<5) k++; //Если a меньше "5", количество "двоечников" увеличивается на один
    if (a==10) flag=true; // если оценка равна "10", то "flag" меняется на "true"(истина). 
}
System.Console.WriteLine(k);
if (flag==true) System.Console.WriteLine("YES"); else System.Console.WriteLine("NO"); 
//Необязательно указывать ""flag==true", можно просто указать "flag".
